In [4]:
import pandas as pd
purchase_1 = pd.Series({'Name': 'Chris',
                        'Item Purchased': 'Dog Food',
                        'Cost': 22.50})
purchase_2 = pd.Series({'Name': 'Kevyn',
                        'Item Purchased': 'Kitty Litter',
                        'Cost': 2.50})
purchase_3 = pd.Series({'Name': 'Vinod',
                        'Item Purchased': 'Bird Seed',
                        'Cost': 5.00})
df = pd.DataFrame([purchase_1, purchase_2, purchase_3], index=['Store 1', 'Store 1', 'Store 2'])
df.head()

          Name Item Purchased  Cost
Store 1  Chris       Dog Food  22.5
Store 1  Kevyn   Kitty Litter   2.5
Store 2  Vinod      Bird Seed   5.0

In [5]:
df.loc['Store 2']

Name                  Vinod
Item Purchased    Bird Seed
Cost                      5
Name: Store 2, dtype: object

In [6]:
type(df.loc['Store 2'])

pandas.core.series.Series

In [11]:
df.loc['Store 1']

          Name Item Purchased  Cost
Store 1  Chris       Dog Food  22.5
Store 1  Kevyn   Kitty Litter   2.5

In [12]:
df.T

                 Store 1       Store 1    Store 2
Name               Chris         Kevyn      Vinod
Item Purchased  Dog Food  Kitty Litter  Bird Seed
Cost                22.5           2.5          5

In [13]:
df['Item Purchased']

Store 1        Dog Food
Store 1    Kitty Litter
Store 2       Bird Seed
Name: Item Purchased, dtype: object

In [14]:
df.loc['Store 1',['Cost']]

         Cost
Store 1  22.5
Store 1   2.5

In [15]:
df.T.loc['Cost']

Store 1    22.5
Store 1     2.5
Store 2       5
Name: Cost, dtype: object

In [16]:
df['Cost']

Store 1    22.5
Store 1     2.5
Store 2     5.0
Name: Cost, dtype: float64

In [17]:
##drop Data does not delete
df.drop('Store 1')

          Name Item Purchased  Cost
Store 2  Vinod      Bird Seed   5.0

In [18]:
df

          Name Item Purchased  Cost
Store 1  Chris       Dog Food  22.5
Store 1  Kevyn   Kitty Litter   2.5
Store 2  Vinod      Bird Seed   5.0

In [19]:
copy_df = df.copy()
copy_df = copy_df.drop('Store 1')
copy_df

          Name Item Purchased  Cost
Store 2  Vinod      Bird Seed   5.0

In [20]:
copy_df.drop?

In [21]:
del copy_df['Name']
copy_df

        Item Purchased  Cost
Store 2      Bird Seed   5.0

In [22]:
df['Location'] = None
df

          Name Item Purchased  Cost Location
Store 1  Chris       Dog Food  22.5     None
Store 1  Kevyn   Kitty Litter   2.5     None
Store 2  Vinod      Bird Seed   5.0     None

In [23]:
df['Cost'] = df['Cost']-df['Cost']*.20

In [24]:
df['Cost']

Store 1    18.0
Store 1     2.0
Store 2     4.0
Name: Cost, dtype: float64

In [25]:
df

          Name Item Purchased  Cost Location
Store 1  Chris       Dog Food  18.0     None
Store 1  Kevyn   Kitty Litter   2.0     None
Store 2  Vinod      Bird Seed   4.0     None

### Dataframe Indexing and Loading

In [27]:
costs = df['Cost']
costs

Store 1    18.0
Store 1     2.0
Store 2     4.0
Name: Cost, dtype: float64

In [29]:
costs +=2
costs

Store 1    22.0
Store 1     6.0
Store 2     8.0
Name: Cost, dtype: float64

In [30]:
df

          Name Item Purchased  Cost Location
Store 1  Chris       Dog Food  22.0     None
Store 1  Kevyn   Kitty Litter   6.0     None
Store 2  Vinod      Bird Seed   8.0     None

In [32]:
!cat olympics.csv

'cat' is not recognized as an internal or external command,
operable program or batch file.